In [2]:
import os

import pandas as pd
from IPython.display import display

import sqlite3

In [5]:
data_csv_path = os.path.join('../data/data.csv')
data = pd.read_csv(data_csv_path)

In [6]:
data.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [7]:
item_columns = ['Item_Identifier','Item_Weight', 'Item_Fat_Content', 'Item_Visibility', 'Item_Type', 'Item_MRP']
item_outlet_sales_columns = ['Item_Identifier', 'Outlet_Identifier','Item_Outlet_Sales']
outlet_columns = [col for col in data.columns if (col not in item_columns and col not in item_outlet_sales_columns) or col == 'Outlet_Identifier']

In [8]:
print('items')
display(data[item_columns].head(3))
print('item_sales')
display(data[item_outlet_sales_columns].head(3))
print('outlets')
display(data[outlet_columns].head(3))

items

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180

item_sales

  Item_Identifier Outlet_Identifier  Item_Outlet_Sales
0           FDA15            OUT049          3735.1380
1           DRC01            OUT018           443.4228
2           FDN15            OUT049          2097.2700

outlets

,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type
0,OUT049,1999,Medium,Tier 1,Supermarket Type1
1,OUT018,2009,Medium,Tier 3,Supermarket Type2
2,OUT049,1999,Medium,Tier 1,Supermarket Type1

Turn to uniques

In [9]:
items = data[item_columns].drop_duplicates()
item_sales = data[item_outlet_sales_columns].drop_duplicates()
outlets = data[outlet_columns].drop_duplicates()

In [10]:
print('items')
display(items.shape)
print('item_sales')
display(item_sales.shape)
print('outlets')
display(outlets.shape)

items

(8523, 6)

item_sales

(8523, 3)

outlets

(10, 5)

## Create Database and Save dataframes to sql tables

But wait!...

<img src="https://starttraffic.uk/image/cache/catalog/product-photos/signs/metal-signs/750mm-triangular/metal-sign-danger-warning-1800x1200_0.jpg">

**First delete the Workshop.db file in the directory "data/" and then run the following cells**

In [11]:
data_path = 'data'

db_path = os.path.join("..",data_path,'WorkshopDB.db')

conn = sqlite3.connect(db_path)  # You can create a new database by changing the name within the quotes
c = conn.cursor() # The database will be saved in the location where your 'py'

items.to_sql('items',conn,index=False)
item_sales.to_sql('item_sales',conn, index=False)
outlets.to_sql('outlets',conn, index=False)

Simple test using cursor and pandas

In [25]:
conn = sqlite3.connect(db_path)
c = conn.cursor()
c.execute('Select * from outlets')
c.fetchall()

[('OUT049', 1999, 'Medium', 'Tier 1', 'Supermarket Type1'),
 ('OUT018', 2009, 'Medium', 'Tier 3', 'Supermarket Type2'),
 ('OUT010', 1998, None, 'Tier 3', 'Grocery Store'),
 ('OUT013', 1987, 'High', 'Tier 3', 'Supermarket Type1'),
 ('OUT027', 1985, 'Medium', 'Tier 3', 'Supermarket Type3'),
 ('OUT045', 2002, None, 'Tier 2', 'Supermarket Type1'),
 ('OUT017', 2007, None, 'Tier 2', 'Supermarket Type1'),
 ('OUT046', 1997, 'Small', 'Tier 1', 'Supermarket Type1'),
 ('OUT035', 2004, 'Small', 'Tier 2', 'Supermarket Type1'),
 ('OUT019', 1985, 'Small', 'Tier 1', 'Grocery Store')]

In [26]:
query = 'SELECT * FROM outlets LIMIT 5;'
pd.read_sql_query(query, conn)

,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type
0,OUT049,1999,Medium,Tier 1,Supermarket Type1
1,OUT018,2009,Medium,Tier 3,Supermarket Type2
2,OUT010,1998,None,Tier 3,Grocery Store
3,OUT013,1987,High,Tier 3,Supermarket Type1
4,OUT027,1985,Medium,Tier 3,Supermarket Type3

<img src="https://sayingimages.com/wp-content/uploads/im-done-my-work-meme.jpg">